src/ChartsOfCharacteristicTypes/ПоказателиОбъектов/ПоказателиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПоказателиОбъектов</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаПоказателейОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Индексируемый</name>
    <comment>не реализовано</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьПоказателяОбъекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполняемыйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентноеЗаданиеГруппыПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <comment>не реализовано</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьРасчетПоРегламетномуЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламетногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьРасчетПоТриггерам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <comment>Параметры запроса или выполняемого кода</comment>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Триггеры</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданныхПО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>CatalogRef.СвойстваОбъектовМетаданныхПО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтложенныйРасчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Владельцы</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданныхПО</types>
      </type>
    </attributes>
    <attributes>
      <name>ВладелецПолноеИмя</name>
      <comment>Нужен для характеристик объектов (в качестве поля отбора)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/CommonModules/ПоказателиОбъектовСобытия/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПередЗаписьюОбъекта(Источник, Отказ) Экспорт
	
	Если (Источник.ОбменДанными.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеОбъекта.ПолноеИмя();
	
	Если (Не ПоказателиОбъектовПовтИсп.ОбъектМетаданыхЯвляетсяТриггером(ПолноеИмяМетаданных)) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСсылкуНовогоПриНеобходимости(Источник);
	
	ИнициализироватьДополнительныеСвойстваСсылочногоОбъекта(Источник);
	
	ВыполнитьЗапросСсылочныйОбъект(Источник.ДополнительныеСвойства, "ВТ_ДоИзменения");
	
КонецПроцедуры

Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если (Источник.ОбменДанными.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеОбъекта.ПолноеИмя();
	
	Если (Не ПоказателиОбъектовПовтИсп.ОбъектМетаданыхЯвляетсяТриггером(ПолноеИмяМетаданных)) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСсылкуНовогоПриНеобходимости(Источник);
	
	ИнициализироватьДополнительныеСвойстваСсылочногоОбъекта(Источник);
	
	ВыполнитьЗапросСсылочныйОбъект(Источник.ДополнительныеСвойства, "ВТ_ДоИзменения");
	
КонецПроцедуры

Процедура ПриЗаписиОбъекта(Источник, Отказ) Экспорт
	
	Если (Источник.ОбменДанными.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
		
	Если (Не ДополнительныеСвойства.Свойство("ПоказателиОбъектов")) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗапросСсылочныйОбъект(ДополнительныеСвойства, "ВТ_ПослеИзменения");
	
	ЗаполнитьЗначенияКлючейТриггеров(ДополнительныеСвойства);
	
	РассчитатьЗависимыеПоказателиПриЗаписи(ДополнительныеСвойства);
		
КонецПроцедуры

Процедура ПередЗаписьюНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	Если (Источник.ОбменДанными.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Источник.Метаданные();
	ПолноеИмяМетаданных = МетаданныеОбъекта.ПолноеИмя();
	
	Если (Не ПоказателиОбъектовПовтИсп.ОбъектМетаданыхЯвляетсяТриггером(ПолноеИмяМетаданных)) Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьДополнительныеСвойстваНабораЗаписей(Источник);
	
	ВыполнитьЗапросНаборЗаписей(Источник.ДополнительныеСвойства, "ВТ_ДоИзменения");
	
КонецПроцедуры

Процедура ПриЗаписиНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	Если (Источник.ОбменДанными.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
		
	Если (Не ДополнительныеСвойства.Свойство("ПоказателиОбъектов")) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗапросНаборЗаписей(ДополнительныеСвойства, "ВТ_ПослеИзменения");
	
	ЗаполнитьЗначенияКлючейТриггеров(ДополнительныеСвойства);
	
	РассчитатьЗависимыеПоказателиПриЗаписи(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДополнительныхСвойствИсточника

Процедура ИнициализироватьДополнительныеСвойстваОбъекта(Источник)
	
	Источник.ДополнительныеСвойства.Вставить("ПоказателиОбъектов", Новый Структура());
	
	// Полное имя метаданных
	ПолноеИмяМетаданных = Источник.Метаданные().ПолноеИмя();
	Источник.ДополнительныеСвойства.ПоказателиОбъектов.Вставить("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
	
	// Менеджер временных таблиц
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Источник.ДополнительныеСвойства.ПоказателиОбъектов.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	
	// Зависимые показатели
	ЗависимыеПоказатели = ПолучитьЗависимыеПоказатели(Источник.Метаданные());
	Источник.ДополнительныеСвойства.ПоказателиОбъектов.Вставить("ЗависимыеПоказатели", ЗависимыеПоказатели);
	
	// Ключи триггеров
	КлючиТриггеров = Новый Массив();
	
	Для Каждого ДанныеПоказателя Из ЗависимыеПоказатели Цикл
		Если (КлючиТриггеров.Найти(ДанныеПоказателя.Ключ) = Неопределено) Тогда
			КлючиТриггеров.Добавить(ДанныеПоказателя.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Источник.ДополнительныеСвойства.ПоказателиОбъектов.Вставить("КлючиТриггеров", КлючиТриггеров);
	
КонецПроцедуры

Процедура ИнициализироватьДополнительныеСвойстваСсылочногоОбъекта(Источник)
	
	ИнициализироватьДополнительныеСвойстваОбъекта(Источник);
	
	Ссылка = ?(Источник.ЭтоНовый(), Источник.ПолучитьСсылкуНового(), Источник.Ссылка);
	
	Источник.ДополнительныеСвойства.ПоказателиОбъектов.Вставить("Ссылка", Ссылка);
	
КонецПроцедуры

Процедура ИнициализироватьДополнительныеСвойстваНабораЗаписей(Источник)
	
	ИнициализироватьДополнительныеСвойстваОбъекта(Источник);
	
	Источник.ДополнительныеСвойства.ПоказателиОбъектов.Вставить("Отбор", Источник.Отбор);
	
КонецПроцедуры

#КонецОбласти

#Область КлючиТриггеров

Процедура ВыполнитьЗапросСсылочныйОбъект(ДополнительныеСвойства, ИмяВременнойТаблицы)
	
	Ссылка					= ДополнительныеСвойства.ПоказателиОбъектов.Ссылка;						
	ПолноеИмяМетаданных		= ДополнительныеСвойства.ПоказателиОбъектов.ПолноеИмяМетаданных;
	МенеджерВременныхТаблиц	= ДополнительныеСвойства.ПоказателиОбъектов.МенеджерВременныхТаблиц;
	Ключи					= ДополнительныеСвойства.ПоказателиОбъектов.КлючиТриггеров;	
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Ключи
		|ПОМЕСТИТЬ #ИмяВременнойТаблицы
		|ИЗ
		|	#Таблица КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Таблица",				ПолноеИмяМетаданных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ключи",					СтрСоединить(Ключи, ", "));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяВременнойТаблицы",	ИмяВременнойТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();	
	
КонецПроцедуры

Процедура ВыполнитьЗапросНаборЗаписей(ДополнительныеСвойства, ИмяВременнойТаблицы)
	
	Отбор					= ДополнительныеСвойства.ПоказателиОбъектов.Отбор;
	ПолноеИмяМетаданных		= ДополнительныеСвойства.ПоказателиОбъектов.ПолноеИмяМетаданных;
	МенеджерВременныхТаблиц	= ДополнительныеСвойства.ПоказателиОбъектов.МенеджерВременныхТаблиц;
	Ключи					= ДополнительныеСвойства.ПоказателиОбъектов.КлючиТриггеров;
	
	// Текст запроса
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Ключи
		|ПОМЕСТИТЬ #ИмяВременнойТаблицы
		|ИЗ
		|	#Таблица КАК Таблица
		|ГДЕ
		|	&Отбор";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Таблица",				ПолноеИмяМетаданных);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ключи",					СтрСоединить(Ключи, ", "));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяВременнойТаблицы",	ИмяВременнойТаблицы);
	
	// Текст отбора
	Если (Отбор.Количество() = 0) Тогда
				
		ТекстОтбора = "ИСТИНА";
				
	Иначе		
		
		КоллекцияТекстовОтбора = Новый Массив();
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если (ЭлементОтбора.Использование) Тогда
				КоллекцияТекстовОтбора.Добавить(СтрШаблон("Таблица.%1 = &%1", ЭлементОтбора.Имя));
			КонецЕсли;
		КонецЦикла;
		
		ТекстОтбора = СтрСоединить(КоллекцияТекстовОтбора, " И ");
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Отбор", ТекстОтбора);
	// Конец Текст отбора
	
	// Конец Текст запроса
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Если (ЭлементОтбора.Использование) Тогда
			Запрос.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияКлючейТриггеров(ДополнительныеСвойства)
	
	ДополнительныеСвойства.ПоказателиОбъектов.Вставить("ЗначенияКлючейТриггеров", Новый Соответствие());
	
	КлючиТриггеров = ДополнительныеСвойства.ПоказателиОбъектов.КлючиТриггеров;
	
	Если (КлючиТриггеров.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонЗапроса =
		"ВЫБРАТЬ
		|	&Ключ КАК Ссылка
		|ИЗ
		|	ВТ_ДоИзменения КАК Таблица
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&Ключ
		|ИЗ
		|	ВТ_ПослеИзменения КАК Таблица";
	
	КоллекцияЗапросов = Новый Массив();
	
	Для Каждого Ключ Из КлючиТриггеров Цикл
		
		ТекстЗапроса = ШаблонЗапроса;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Ключ", "Таблица." + Ключ);
		
		КоллекцияЗапросов.Добавить(ТекстЗапроса);
		
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(КоллекцияЗапросов, РазделительПакетаЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ПоказателиОбъектов.МенеджерВременныхТаблиц;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Для Индекс = 0 По КлючиТриггеров.Количество() - 1 Цикл
		
		МассивОбъектов = Новый Массив();
		
		ВыборкаОбъектов = РезультатыЗапроса[Индекс].Выбрать();
		Пока (ВыборкаОбъектов.Следующий()) Цикл
			МассивОбъектов.Добавить(ВыборкаОбъектов.Ссылка);
		КонецЦикла;
		
		ДополнительныеСвойства.ПоказателиОбъектов.ЗначенияКлючейТриггеров.Вставить(
			КлючиТриггеров[Индекс], МассивОбъектов);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПоказателями

Процедура РассчитатьЗависимыеПоказателиПриЗаписи(ДополнительныеСвойства)
		
	ЗависимыеПоказатели = ДополнительныеСвойства.ПоказателиОбъектов.ЗависимыеПоказатели;
	
	Если (ЗависимыеПоказатели.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;

	ЗначенияКлючейТриггеров = ДополнительныеСвойства.ПоказателиОбъектов.ЗначенияКлючейТриггеров;
	
	Для Каждого ДанныеПоказателя Из ЗависимыеПоказатели Цикл

		Показатель		= ДанныеПоказателя.Показатель;	
		МассивОбъектов	= ЗначенияКлючейТриггеров[ДанныеПоказателя.Ключ];
		
		Если ДанныеПоказателя.ОтложенныйРасчет Тогда
			ПоказателиОбъектов.ЗарегистрироватьОтложенныйРасчетПоказателя(Показатель, МассивОбъектов);			
		Иначе
			ПоказателиОбъектов.РассчитатьПоказатель(Показатель, МассивОбъектов);
		КонецЕсли;
					
	КонецЦикла;
	
КонецПроцедуры

// TODO. Переделать на повторное использование
Функция ПолучитьЗависимыеПоказатели(ОбъектМетаданных)
	
	Результат = Новый Массив;
	
	ОбъектМетаданныхСсылка = ПоказателиОбъектовПовтИсп.ПолучитьСсылкуОбъектаМетаданных(ОбъектМетаданных.ПолноеИмя());
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ОбъектМетаданных", ОбъектМетаданныхСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоказателиОбъектовТриггеры.Ссылка КАК Показатель,
		|	ЕСТЬNULL(ПоказателиОбъектовТриггеры.Ключ.Наименование, """") КАК Ключ,
		|	ПоказателиОбъектовТриггеры.ОтложенныйРасчет КАК ОтложенныйРасчет
		|ИЗ
		|	ПланВидовХарактеристик.ПоказателиОбъектов.Триггеры КАК ПоказателиОбъектовТриггеры
		|ГДЕ
		|	ПоказателиОбъектовТриггеры.ОбъектМетаданных = &ОбъектМетаданных
		|	И ПоказателиОбъектовТриггеры.Ссылка.ЗапускатьРасчетПоТриггерам";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПоказательСтруктура = Новый Структура("Показатель, Ключ, ОтложенныйРасчет");
		ЗаполнитьЗначенияСвойств(ПоказательСтруктура, Выборка);
		
		Результат.Добавить(ПоказательСтруктура);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция РазделительПакетаЗапросов()
	
	Возврат
		"
		|
		|;
		|
		|";
	
КонецФункции

Процедура УстановитьСсылкуНовогоПриНеобходимости(Источник)
	
	Если Не Источник.ЭтоНовый() Или Не Источник.ПолучитьСсылкуНового().Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяМетаданных = Источник.Метаданные().ПолноеИмя();
	ПолноеИмяМетаданныхСлова = СтрРазделить(ПолноеИмяМетаданных, ".");
	Тип = ПолноеИмяМетаданныхСлова[0];
	Вид = ПолноеИмяМетаданныхСлова[1];
	
	Если Тип = "Справочник" Тогда
		Менеджер = Справочники[Вид];
	ИначеЕсли Тип = "Документ" Тогда
		Менеджер = Документы[Вид];
	Иначе
		ВызватьИсключение НСтр("ru = 'Неожиданный тип источника'");
	КонецЕсли;
	
	НоваяСсылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор());
	Источник.УстановитьСсылкуНового(НоваяСсылка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
